In [1]:
import pandas as pd
import numpy as np

## Importing text files

In [2]:
file = open("hello_world.txt", mode="r")
print(file.read())
print(file.closed)

Hello World is the first line that I learned to code in Python.
This is a great foundation to start from.
False

In [3]:
file.close()
print(file.closed)

True

### Context Manager

In [4]:
with open("hello_world.txt", "r") as file:
    print(file.readline())
    print(file.readline())

Hello World is the first line that I learned to code in Python.

This is a great foundation to start from.

## Importing flat files using numpy

In [5]:
file = "mnist_digits.csv"
data = np.loadtxt(file, delimiter=",")
data

array([[1., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [1., 0., 0., ..., 0., 0., 0.],
       ...,
       [2., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [5., 0., 0., ..., 0., 0., 0.]])

In [6]:
data = np.loadtxt(
    file, delimiter=",", skiprows=1, usecols=[0, 1]
)  # skipping the first row and importing the first 2 columns
data

array([[0., 0.],
       [1., 0.],
       [4., 0.],
       [0., 0.],
       [0., 0.],
       [7., 0.],
       [3., 0.],
       [5., 0.],
       [3., 0.],
       [8., 0.],
       [9., 0.],
       [1., 0.],
       [3., 0.],
       [3., 0.],
       [1., 0.],
       [2., 0.],
       [0., 0.],
       [7., 0.],
       [5., 0.],
       [8., 0.],
       [6., 0.],
       [2., 0.],
       [0., 0.],
       [2., 0.],
       [3., 0.],
       [6., 0.],
       [9., 0.],
       [9., 0.],
       [7., 0.],
       [8., 0.],
       [9., 0.],
       [4., 0.],
       [9., 0.],
       [2., 0.],
       [1., 0.],
       [3., 0.],
       [1., 0.],
       [1., 0.],
       [4., 0.],
       [9., 0.],
       [1., 0.],
       [4., 0.],
       [4., 0.],
       [2., 0.],
       [6., 0.],
       [3., 0.],
       [7., 0.],
       [7., 0.],
       [4., 0.],
       [7., 0.],
       [5., 0.],
       [1., 0.],
       [9., 0.],
       [0., 0.],
       [2., 0.],
       [2., 0.],
       [3., 0.],
       [9., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [5., 0.],
       [0., 0.],
       [6., 0.],
       [3., 0.],
       [4., 0.],
       [8., 0.],
       [1., 0.],
       [0., 0.],
       [3., 0.],
       [9., 0.],
       [6., 0.],
       [2., 0.],
       [6., 0.],
       [4., 0.],
       [7., 0.],
       [1., 0.],
       [4., 0.],
       [1., 0.],
       [5., 0.],
       [4., 0.],
       [8., 0.],
       [9., 0.],
       [2., 0.],
       [9., 0.],
       [9., 0.],
       [8., 0.],
       [9., 0.],
       [6., 0.],
       [3., 0.],
       [6., 0.],
       [4., 0.],
       [6., 0.],
       [2., 0.],
       [9., 0.],
       [1., 0.],
       [2., 0.],
       [0., 0.],
       [5., 0.]])

### Numpy using mixed data types

In [7]:
data = np.genfromtxt("titanic_sub.csv", delimiter=",", names=True, dtype=None)
data[:2]

D:\anaconda3\lib\site-packages\ipykernel_launcher.py:1: VisibleDeprecationWarning: Reading unicode strings without specifying the encoding argument is deprecated. Set the encoding, use None for the system default.
  """Entry point for launching an IPython kernel.

array([(1, 0, 3, b'male', 22., 1, 0, b'A/5 21171',  7.25  , b'', b'S'),
       (2, 1, 1, b'female', 38., 1, 0, b'PC 17599', 71.2833, b'C85', b'C')],
      dtype=[('PassengerId', '<i4'), ('Survived', '<i4'), ('Pclass', '<i4'), ('Sex', 'S6'), ('Age', '<f8'), ('SibSp', '<i4'), ('Parch', '<i4'), ('Ticket', 'S18'), ('Fare', '<f8'), ('Cabin', 'S15'), ('Embarked', 'S1')])

genfromtxt is used when the different columns have different data types like string, float etc. The third argument names refers to the fact that there is a header.

## Importing flatfiles using Pandas

In [9]:
data = pd.read_csv('titanic_sub.csv',nrows=3,header=None)
data.head()

,0,1,2,3,4,5,6,7,8,9,10
0,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,1,0,3,male,22.0,1,0,A/5 21171,7.25,NaN,S
2,2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C

In [10]:
data = pd.read_csv('titanic_sub.csv')
data.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,male,35.0,0,0,373450,8.0500,NaN,S

In [11]:
data_array = data.values
print(type(data_array))

<class 'numpy.ndarray'>

Data.values converts a pandas dataframe into an array.